<template>
    <section class="about-preview container">
        <p>
            <strong>לורם איפסום דולור סיט אמט,</strong>
            קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי.
            <nuxt-link to="/about" class="link">
                קרא עוד...
            </nuxt-link>
        </p>
    </section>
</template>

<script>
export default {
    props: {}
}
</script>
